IRP/src/Documents/PhysicalInventory/PhysicalInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PhysicalInventory</name>
  <registerRecords>AccumulationRegister.StockAdjustmentAsWriteOff</registerRecords>
  <registerRecords>AccumulationRegister.StockAdjustmentAsSurplus</registerRecords>
  <registerRecords>AccumulationRegister.StockBalance</registerRecords>
  <registerRecords>AccumulationRegister.StockReservation</registerRecords>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpCount</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PhysCount</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Difference</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ResponsiblePerson</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/PhysicalCountByLocation/PhysicalCountByLocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PhysicalCountByLocation</name>
  <posting>Deny</posting>
  <attributes>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Barcode</name>
    <type>
      <types>DefinedType.typeBarcode</types>
    </type>
  </attributes>
  <attributes>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>PhysicalInventory</name>
    <type>
      <types>DocumentRef.PhysicalInventory</types>
    </type>
  </attributes>
  <attributes>
    <name>ResponsiblePerson</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ObjectStatuses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpCount</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>PhysCount</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Difference</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/PhysicalInventory/ObjectModule.bsl
Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	PhysicalCountByLocation.Ref
	|FROM
	|	Document.PhysicalCountByLocation AS PhysicalCountByLocation
	|WHERE
	|	NOT PhysicalCountByLocation.DeletionMark
	|	AND PhysicalCountByLocation.PhysicalInventory = &PhysicalInventory
	|	AND
	|	NOT PhysicalCountByLocation.Status.Posting";
	Query.SetParameter("PhysicalInventory", ThisObject.Ref);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	If QuerySelection.Next() Then
		CommonFunctionsClientServer.ShowUsersMessage(R().Error_075, "Object.Status");
	EndIf;
EndProcedure
